# -*- coding: utf-8 -*-
# from seleniumwire import webdriver
#
# web_driver = webdriver.Chrome(executable_path = "webDriver/chromedriver.exe")
#
#
# web_driver.get('file:///A:/pycharm%20projects/VistaBot/web/users.html')
#
# for request in web_driver.requests:
#     if request.response:
#         if 'get_users' in request.url:
#             print(request.response.body.decode('utf-8'))
#
# web_driver.close()

import difflib
import itertools
import json


def maxRatio(string, database):
    mx = ['', 0]
    for i in database:
        for undStringList in itertools.permutations(string.split(' ')):
            undString = ' '.join(undStringList)
            match = difflib.SequenceMatcher(None, undString, i).ratio()
            if match > mx[1]:
                mx = [i, round(match, 2)]
    return mx


with open('data/Cities.txt', 'r', encoding = 'utf-8') as file:
    cities = json.loads(file.read())['response']

citiesNames = [i['cityName'] for i in cities]

testCities = ['ירושלים', 'הרצליה ', 'הרצליה ', 'הרצליה ', 'נתניה', 'נתניה', 'חדרה', 'חדרה', 'חדרה', 'חדרה', 'חדרה', 'ראשון לציון', 'אילת ', 'אילת ', 'מושב מנחמיה ', 'מושב מנחמיה ', 'ראשון לציון ', 'ראשון לציון ', 'יבנה ', 'יבנה ', 'יבנה ', 'יבנה ', 'גדרה', 'גדרה', 'גדרה', 'גדרה', ' הוד השרון  ', ' הוד השרון  ', "ביר הדאג'", "ביר הדאג'", "ביר הדאג'", 'גינתון', 'טבריה עלית בלוק 6', 'טבריה עלית בלוק 6', 'נהריה ', 'חיפה', 'שגב שלום ', 'אור עקיבא', 'אור עקיבא', 'אור עקיבא', 'אור עקיבא', 'אילת', 'אילת', 'ראשון לציון', 'ראשון לציון', 'יוקנעם ', 'יוקנעם ', 'יוקנעם ', 'קריית ים', 'קריית ים', 'קריית ים', 'כפר סבא ', 'בית שאן ', 'בית שאן ', 'ראשון לציון', 'נתיבות ', 'נתיבות ', 'רמלה', 'רמלה', 'רמלה', 'רמלה', 'רמלה', 'בני ברק', 'בני ברק', 'ירושלים', 'ירושלים', 'ירושלים', 'ירושלים', 'עפולה', 'כפר מנדא ', 'חיפה ', 'חיפה ', 'חיפה ', 'חיפה ', 'ערד', 'ערד', 'רמת גן', 'רמת גן', 'רמת גן', 'רמת גן', 'ירושלים', 'ירושלים', 'חולון', 'בני ברק', 'אור יהודה ', 'אור יהודה ', 'אור יהודה ', 'אור יהודה ', 'אור יהודה ', 'קרית מלאכי', 'ירושלים', 'ירושלים', 'ירושלים', 'ירושלים', 'ירושלים', 'ירושלים', 'ירושלים', 'ירושלים', 'ירושלים', 'נתיבות', 'אלעד', 'ירושלים', 'קיבוץ לביא', 'קיבוץ לביא', 'קיבוץ לביא', 'קיבוץ לביא', 'הוד השרון', 'הוד השרון', 'הרצליה', 'הרצליה', 'מושב גבעת כוח', 'נתניה', 'נתניה', 'נתניה', 'נתניה', 'נתניה', 'נתניה', 'כפר קיש', 'כפר קיש', 'כפר קיש', 'כפר קיש', 'אשקלון', 'אשקלון', 'אריאל', 'אריאל', 'ירושלים', 'ירושלים', 'ירושלים', 'ירושלים', 'ראשון לציון', 'ראשון לציון', 'בני ברק', 'בני ברק', 'ירושלים', 'אשדוד', 'אשדוד', 'אשדוד', 'אשדוד', 'אשדוד', 'שדרות', 'שדרות', 'שדרות', 'שדרות', 'טבריה', 'טבריה', 'טבריה', 'טבריה', 'ירושלים', 'ירושלים', 'מודיעין', 'מודיעין', 'מודיעין', 'תל אביב', 'ראשון לציון', 'ראשון לציון', 'ראשון לציון', 'נתיבות', 'נתיבות', 'גבעת שמואל', 'תל אביב', 'תל אביב', 'מושב מיתרים ', 'מושב מיתרים ', 'אלית', 'ישוב עופרה', 'ישוב עופרה', 'ישוב עופרה', 'באר שבע', 'באר שבע', 'תל אביב ', 'תל אביב ', 'תל אביב ', 'תל אביב ', 'נצרת עילית', 'נצרת עילית', 'בני ברק ', 'בני ברק ', 'בני ברק ', 'הוד השרון', 'הוד השרון', 'כפר מנדא', 'כפר מנדא', 'כפר מנדא', 'כפר מנדא', 'כפר מנדא', 'חדרה ', 'חדרה ', 'חדרה ', 'חדרה ', 'חדרה ', 'חדרה ', 'רחובות ', 'אשקלון ', 'אשקלון ', 'אשקלון', 'אשקלון', "שייח' דנון", "שייח' דנון", "שייח' דנון", "שייח' דנון", "שייח' דנון", 'רהט ', 'רהט ', 'רהט ', 'כפר הרא"ה', 'כפר הרא"ה', 'כפר הרא"ה', 'כפר הרא"ה', 'כפר הרא"ה', 'פתח תקווה ', 'פתח תקווה ', 'פתח תקווה ', 'פתח תקווה ', 'פתח תקווה ', 'פתח תקווה ', 'אשדוד בית עזרא', 'רמת גן ', 'רמת גן ', 'רמת גן ', 'רמת גן ', 'רמת גן ', 'נתניה', 'נתניה', 'נתניה', 'נתניה', 'נצרת', 'נצרת', 'נצרת', 'חולון', 'חולון', 'חולון', 'ברוכין', 'ברוכין', 'ברוכין', 'ברוכין', 'ברוכין', 'ברוכין', 'טמרה', 'טמרה', 'טמרה', 'טמרה', 'ירושלים ', 'ירושלים ', 'ירושלים ', 'הוד השרון', 'הוד השרון', 'הוד השרון', 'הוד השרון', 'הוד השרון', 'ירושלים', 'דורי 6 דירה 5', 'דורי 6 דירה 5', 'דורי 6 דירה 5', 'דורי 6 דירה 5', 'דורי 6 דירה 5', 'בת ים', 'בת ים', 'בת ים', 'אשקלון', 'אשקלון', 'יהוד', 'יהוד', 'יהוד', 'יהוד', 'מעלות-תרשיחא', 'מעלות-תרשיחא', 'מעלות-תרשיחא', 'מעלות-תרשיחא', 'מודיעין', 'מודיעין', 'בענה ', 'ירושלים ', 'ירושלים ', 'ירושלים ', 'ירושלים', 'ירושלים', 'באר שבע ', 'חיפה', 'חיפה', 'חיפה', 'חיפה', 'חיפה', 'חיפה', 'יצהר', 'באר שבע', 'באר שבע', 'באר שבע', 'באר שבע', 'תל אביב', 'תל אביב', 'תל אביב', 'תל אביב', 'תל אביב', 'תל אביב', 'מעלה אדומים', 'מעלה אדומים', 'מעלה אדומים', 'מעלה אדומים', 'מעלה אדומים', 'יבנה', 'נתניה ', 'יהוד', 'בת ים ', 'בת ים ', 'בת ים ', 'רחובות  ', 'רחובות  ', 'רחובות  ', 'רחובות  ', 'רחובות  ', 'חיפה', 'ירושלים', 'ירושלים', 'גבעתיים', 'גבעתיים', 'חולון ', 'חולון ', 'חולון ', 'חולון ', 'חולון ', 'חולון ', 'חולון ', 'זכרון יעקב  ', 'שדרות  ', 'שדרות  ', 'שדרות  ', 'שדרות  ', 'שדרות  ', 'שדרות  ', 'שדרות  ', 'שדרות  ', 'שדרות  ', 'שדרות  ', 'שדרות  ', 'קרית גת', 'קרית גת', 'מגדל העמק ', 'תל אביב', 'תל אביב', 'תל אביב', 'תל אביב', 'תל אביב', 'רשפון', 'רשפון', 'נשר ', 'נשר ', 'נשר ', 'גדרה  ', 'גדרה  ', 'גדרה  ', 'פתח תקווה', 'פתח תקווה', 'פתח תקווה', 'ירושלים', 'ירושלים', 'ירושלים', 'ירושלים', 'ירושלים', 'ירושלים', 'ירושלים', 'כפר ערערה', 'כפר ערערה', 'כפר ערערה', 'כפר ערערה', 'כפר ערערה', 'רעננה', 'רעננה', 'יקיר', 'יקיר', 'יקיר', 'יקיר', 'חיפה', 'חיפה', 'חיפה', 'חיפה', 'חיפה', 'כפר שאט', 'אשקלון ', 'אשקלון ', 'אשקלון ', 'פסגת זאב', 'פסגת זאב', 'ראש העין', 'ראש העין', 'באר שבע', 'ירושלים', 'ירושלים', 'ירושלים', 'ירושלים', 'ירושלים', 'ראש פינה', 'קריית ביאליק', 'תושיה ', 'תושיה ', 'תושיה ', 'תושיה ', 'תושיה ', 'תושיה ', 'לוד', 'לוד', 'אשדוד ', 'אשדוד ', 'אשדוד ', 'שחרות ', 'שחרות ', 'שחרות ', 'שחרות ', 'ירושלים ', 'ירושלים', 'באר שבוע', 'רמלה', 'רמלה', 'בן זכאי', 'בן זכאי', 'בן זכאי', 'בן זכאי', 'בן זכאי', "יאנוח-ג'ת", "יאנוח-ג'ת", 'ירושלים', 'ירושלים', 'ירושלים', 'ירושלים', 'ירושלים', 'קיבוץ דברת', 'קיבוץ דברת', 'קריית מלאכי ', 'קריית מלאכי ', 'קריית מלאכי ', 'קריית מלאכי ', 'יפיע', 'יפיע', 'יפיע', 'יפיע', 'יפיע', 'יפיע', 'יפיע', 'סאגור', 'שפרעם', 'שפרעם', 'בית שאן', 'ניצן', 'ניצן', 'ניצן', 'ניצן', 'דימונה', 'ירושלים ', 'ירושלים ', 'ירושלים ', 'ירושלים ', 'ירושלים ', 'ירושלים ', 'ירושלים ', 'ירושלים ', 'ירושלים ', 'ירושלים ', 'ירושלים ', 'ירושלים ', 'ירושלים ', 'ירושלים', 'חיננית', 'חיננית', 'חיננית', 'חיננית', 'חיננית', 'חיננית', 'אשדוד', 'ירושלים', 'ירושלים', 'ירושלים', 'ראש העין', 'ראש העין', 'בני ברק', 'רעננה', 'רעננה', 'רעננה', 'רעננה', 'רחובות', 'מודיעין', 'מודיעין', 'מודיעין', 'מודיעין', 'מודיעין', 'מודיעין', 'יקנעם עילית ', 'יקנעם עילית ', 'יקנעם עילית ', 'בית שאן ', 'לקיה', 'לקיה', 'לקיה', 'לקיה', 'לקיה', 'אבו סנן', 'אבו סנן', 'אבו סנן', 'אבו סנן', 'אבו סנן', 'פתח תקווה', 'חיפה', 'חיפה', 'חיפה', 'פתח תקווה', 'פתח תקווה', 'אשקלון ', 'אשקלון ', 'אשקלון ', 'אשקלון ', 'באר שבע ', 'באר שבע ', 'קריית מלאכי', 'קריית מלאכי', 'קריית מלאכי', 'אפרתה', 'נס ציונה ', 'נס ציונה ', 'נס ציונה ', 'כפר סבא', 'כפר סבא', 'כפר סבא', 'כפר סבא', 'כפר סבא', 'כפר סבא', 'ראשון לציון', 'ראשון לציון', 'פרדס חנה', 'פרדס חנה', 'פרדס חנה', 'קרית מלאכי', 'קרית מלאכי', 'גילו', 'גילו', 'גילו', 'גילו', 'גילו', 'אום אל פאחם ', 'אום אל פאחם ', 'אום אל פאחם ', 'אום אל פאחם ', 'אום אל פאחם ', 'ראשון לציןון  ', '0', 'שוהם', 'תל אביב', 'תל אביב', 'תל אביב', 'תל אביב', 'תל אביב', 'אשדוד', 'קריית אתא', 'קריית אתא', 'קריית אתא', 'קריית אתא', 'קריית אתא', 'קריית אתא', 'קריית אתא', 'רמת גן ', 'ירושלים', 'ירושלים', 'חדרה', 'ימין אורד', 'ימין אורד', 'בני ברק', 'בני ברק', 'בני ברק', 'בני ברק', 'בני ברק', 'בני ברק', 'בני ברק', 'חיפה', 'חיפה', 'חיפה', 'לוד', 'לוד', 'לוד', 'לוד', 'מבשרת ציון', 'מבשרת ציון ', 'מבשרת ציון ', 'מבשרת ציון ', 'מבשרת ציון ', 'מודיעין מכבים רעות', 'ירושלים ', 'ירושלים ', 'ירושלים ', 'ירושלים ', 'ירושלים ', 'ירושלים ', 'ירושלים ', 'טירת הכרמל ', 'בני ברק ', 'ירושלים ', 'ירושלים ', 'אור עקיבא ', 'אור עקיבא ', 'אור עקיבא ', 'אור עקיבא ', 'ראשון לציון', 'ראשון לציון', 'ראשון לציון', 'בסיס שיזפון', 'כספיה', 'כספיה', 'כספיה', 'ירושלים ', 'אום אל-פחם', 'בני ברק ', 'נתניה ', 'נתניה ', 'נתניה ', 'נתניה ', 'טירה', 'טירה', 'טירה', 'טירה', 'טירה', 'כרמיאל', 'כרמיאל', 'ירושליים', 'ירושליים', 'ירושליים', 'ירושליים', 'ירושליים', 'ירושליים', 'כפר סבא', 'כפר סבא', 'בענה', 'בענה', 'בענה', 'בענה', 'בת שמש', 'בת שמש', 'בת שמש', 'בת שמש', 'בת שמש', 'גבעת עדה ', 'גבעת עדה ', 'גבעת עדה ', 'גבעת עדה ', 'איכסאל', 'רמת השרון', 'רמת השרון', 'חולון', 'חולון', 'חולון', 'חולון', 'חולון', 'תמרה', 'תמרה', 'תמרה', 'תמרה', 'תמרה', 'גבעת שמואל ', 'גבעת שמואל ', 'תל אביב', 'תל אביב', 'תל אביב', 'תל אביב', 'בית שמש', 'בית שמש', 'בית שמש', 'ראשון לציון', 'ראשון לציון', 'ירושלים', 'אור יהודה', 'הרצליה', 'קריית ארבע', 'נתיבות ', 'נתיבות ', 'נתיבות ', 'נתיבות ', 'נתיבות ', 'נתיבות ', 'נתיבות ', 'נתיבות ', 'קיבוץ אדמית', 'חיפה  ', 'חיפה  ', 'חיפה  ', 'חיפה  ', 'חיפה  ', 'יהוד מונסון ', 'הוד השרון', 'הוד השרון', 'בסמ"ה', 'בסמ"ה', 'בסמ"ה', 'מצפה רמון', 'מצפה רמון', 'מצפה רמון', 'מצפה רמון', 'מצפה רמון', 'מצפה רמון', 'מצפה רמון', 'מצפה רמון', 'חריש ', 'חריש ', 'ירושלים', 'ירושלים', 'ירושלים', 'ירושלים', 'ירושלים', 'ירושלים', 'אום אל פאחם ', 'אום אל פאחם ', 'אום אל פאחם ', 'אום אל פאחם ', 'שגב שלום', 'שגב שלום', 'שגב שלום', 'שגב שלום', 'שגב שלום', 'ישוב בת הדר', 'ישוב בת הדר', 'ישוב בת הדר', 'ירושלים', 'ירושלים', 'ירושלים', 'ירושלים', 'ירושלים', 'ירושלים', 'ירושלים', 'ירושלים', 'גילון', 'גילון', 'גילון', 'גילון', 'גילון', 'תלמון', 'תלמון', 'בית שאן', 'טבריה ', 'טבריה ', 'טבריה ', 'עספיה', 'עספיה', 'עספיה', 'עספיה', 'עספיה', 'עספיה', 'עספיה', 'טבריה ', 'שלומי', 'דייר חנא  1  ', 'ירושלים', 'ירושלים', 'ירושלים', 'ירושלים', 'ירושלים', 'חיפה', 'חיפה', 'חיפה']
print(len(testCities))


testCities = list(set(testCities))

testCitiesNew = []
for i in testCities:
    city = i
    while city.startswith(' '):
        city = city[1:]
    while city.endswith(' '):
        city = city[:-1]
    testCitiesNew.append(city)

testCities = testCitiesNew

for i in testCities:
    if i in citiesNames:
        continue

    ratio = maxRatio(i, citiesNames)

    print(i,'|', ratio[0], ratio[1])
